{
  "common": {
    "close": "Close",
    "download": "Download",
    "website": "Website",
    "desaway": "Property of Desaway"
  },
  "Header": {
    "home": "Home",
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact"
  },
  "Home": {
    "welcome": "Hello 🖖🏻! I am",
    "presentation": "I consider myself a very curious person, which allows me to constantly learn new tools and implementations. I enjoy teamwork and collaboration between everyone to achieve objectives. I am open to new ideas and ways of working to improve as a professional.",
    "nameFunction": "welcome",
    "aboutMe": "aboutMe",
    "name": "name",
    "lastName": "lastName",
    "age": "age",
    "languages": "languages",
    "spanish": "spanish",
    "english": "english",
    "currentCountry": "currentCountry",
    "spain": "Spain",
    "nationality": "nationality",
    "argentina": "Argentina",
    "italian": "Italian",
    "viewCV": "View CV"
  },
  "Skills": {
    "title": "Skills",
    "js": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. It is a prototype-based, multi-paradigm, single-threaded, dynamic language, with support for object-oriented, imperative and declarative programming (e.g. functional programming).",
    "next": "Next.js is a React framework for building full-stack web applications. You use React Components to build user interfaces, and Next.js for additional features and optimizations.Under the hood, Next.js also abstracts and automatically configures tooling needed for React, like bundling, compiling, and more. This allows you to focus on building your application instead of spending time with configuration.",
    "react": "React is a JavaScript library for rendering user interfaces. UI is built from small units like buttons, text, and images. React lets you combine them into reusable, nestable components. React Native is an open source framework for building Android and iOS applications using React and the app platform’s native capabilities.",
    "firebase": "Firebase is a cloud platform for developing web and mobile applications. Its essential function is to make the creation of web and mobile applications and their development easier. Its tools are varied and easy to use. Their purposes can be divided into four groups: development, growth, monetization and analysis.",
    "ts": "TypeScript is a superset of JavaScript that adds optional static typing and advanced features to JavaScript. It has been developed by Microsoft and was first published in October 2012. It allows us to write code with fewer errors, in a simpler, more consistent and easier to test way.",
    "node": "Node.js is an open source, cross-platform JavaScript runtime environment. A Node.js application runs in a single process, without creating a new thread for each request. When Node.js performs an I/O operation, such as accessing a database, instead of blocking the thread and wasting CPU cycles waiting, Node.js will resume operations when the response arrives. This allows Node.js to handle thousands of simultaneous connections to a single server.",
    "prisma": "Prisma is an open-source next-generation ORM. It consists of the following parts: Prisma Client: Auto-generated and type-safe query builder for Node.js & TypeScript. Prisma Migrate: Migration system. Prisma Studio: GUI to view and edit data in your database. Prisma Client can be used in any Node.js or TypeScript backend application. This can be a REST API, a GraphQL API, a gRPC API, or anything else that needs a database.",
    "postgres": "PostgreSQL is a powerful, open source object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. PostgreSQL comes with many features aimed at help developers build applications, protect data integrity, create fault-tolerant environments, and help them manage their data no matter how big or small the dataset is."
  },
  "Projects": {
    "title": "Projects",
    "bitePlanner": "Meal planner and organizer developed with React Native and MobX. Create personalized meal plans for each day of the week, ensuring a balanced and varied diet.",
    "stopXenofobia": "Application developed with React Native intended to inform about the resources available to guarantee human rights against racism and xenophobia.",
    "pokedex": "Discover and analyze the first 150 pokemon. Application developed with React Native where I use a third-party API to obtain the information.",
    "moviesDB": "Research the latest releases, the most popular movies and discover their synopsis. Application developed with React Native where I use a third-party API to obtain the information.",
    "calculator": "Project carried out with React Native where I seek to imitate the iOS calculator. It has the main functions of addition, subtraction, division, multiplication.",
    "rogerRestaurant": "Restaurant reservation website developed with Next.Js. The restaurant owner will be able to obtain all the data from them to carry out detailed monitoring."
  }
}
