{
  "common": {
    "close": "Close",
    "download": "Download",
    "website": "Website",
    "desaway": "Property of Desaway"
  },
  "Header": {
    "home": "Home",
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact"
  },
  "Home": {
    "welcome": "Hello 🖖🏻! I am",
    "presentation": "I consider myself a very curious person, which allows me to constantly learn new tools and implementations. I enjoy teamwork and collaboration between everyone to achieve objectives. I am open to new ideas and ways of working to improve as a professional.",
    "nameFunction": "welcome",
    "aboutMe": "aboutMe",
    "name": "name",
    "lastName": "lastName",
    "age": "age",
    "languages": "languages",
    "spanish": "spanish",
    "english": "english",
    "currentCountry": "currentCountry",
    "spain": "Spain",
    "nationality": "nationality",
    "argentina": "Argentina",
    "italian": "Italian",
    "viewCV": "View CV"
  },
  "Skills": {
    "title": "Skills",
    "js": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. It is a prototype-based, multi-paradigm, single-threaded, dynamic language, with support for object-oriented, imperative and declarative programming (e.g. functional programming).",
    "next": "Next.js is a React framework for building full-stack web applications. You use React Components to build user interfaces, and Next.js for additional features and optimizations.Under the hood, Next.js also abstracts and automatically configures tooling needed for React, like bundling, compiling, and more. This allows you to focus on building your application instead of spending time with configuration.",
    "react": "React is a JavaScript library for rendering user interfaces. UI is built from small units like buttons, text, and images. React lets you combine them into reusable, nestable components. React Native is an open source framework for building Android and iOS applications using React and the app platform’s native capabilities.",
    "firebase": "Firebase is a cloud platform for developing web and mobile applications. Its essential function is to make the creation of web and mobile applications and their development easier. Its tools are varied and easy to use. Their purposes can be divided into four groups: development, growth, monetization and analysis.",
    "ts": "TypeScript is a superset of JavaScript that adds optional static typing and advanced features to JavaScript. It has been developed by Microsoft and was first published in October 2012. It allows us to write code with fewer errors, in a simpler, more consistent and easier to test way.",
    "node": "Node.js is an open source, cross-platform JavaScript runtime environment. A Node.js application runs in a single process, without creating a new thread for each request. When Node.js performs an I/O operation, such as accessing a database, instead of blocking the thread and wasting CPU cycles waiting, Node.js will resume operations when the response arrives. This allows Node.js to handle thousands of simultaneous connections to a single server.",
    "prisma": "Prisma is an open-source next-generation ORM. It consists of the following parts: Prisma Client: Auto-generated and type-safe query builder for Node.js & TypeScript. Prisma Migrate: Migration system. Prisma Studio: GUI to view and edit data in your database. Prisma Client can be used in any Node.js or TypeScript backend application. This can be a REST API, a GraphQL API, a gRPC API, or anything else that needs a database.",
    "postgres": "PostgreSQL is a powerful, open source object-relational database system that uses and extends the SQL language combined with many features that safely store and scale the most complicated data workloads. PostgreSQL comes with many features aimed at help developers build applications, protect data integrity, create fault-tolerant environments, and help them manage their data no matter how big or small the dataset is."
  },
  "Projects": {
    "title": "Projects",
    "subtitle": "The projects shown below were developed in collaboration with the Desaway company and are subject to privacy and confidentiality rights. For this reason, I cannot provide detailed information or additional images. I appreciate your understanding.",
    "bitePlanner": "Meal planner and organizer developed with React Native and MobX. Create personalized meal plans for each day of the week, ensuring a balanced and varied diet.",
    "pokedex": "Discover and analyze the first 150 pokemon. Application developed with React Native where I use a third-party API to obtain the information.",
    "moviesDB": "Research the latest releases, the most popular movies and discover their synopsis. Application developed with React Native where I use a third-party API to obtain the information.",
    "calculator": "Project carried out with React Native where I seek to imitate the iOS calculator. It has the main functions of addition, subtraction, division, multiplication.",
    "workhub": "Platform designed for the management and reservation of workspaces, meeting rooms and shared spaces. You can easily create custom workspaces optimized for your specific needs.",
    "labelPlatformTitle": "Label Platform",
    "labelPlatformDescription": "Project created mainly with Next.Js, Next UI and Prisma. Its objective is to optimize shipping management by grouping equal orders. The platform allows users to complete a single order or group multiple identical orders into a single set. The process works as follows: Users enter their orders on the platform. The interface automatically detects orders that contain the same products. The same orders are grouped, allowing users to manage them together. This not only simplifies the shipping process, but can also reduce costs and processing time. Users can choose to complete an order individually or the set of orders grouped together. Once the user decides to complete the order (individual or joint), the system automatically generates a shipping label. This label includes all the information necessary to dispatch the package by mail. The main benefit of this system is the improved efficiency in order and shipping management, allowing for a faster and more economical process. Bundling orders also reduces the number of shipments required, contributing to more sustainable practices.",
    "stopXenofobiaTitle": "Xenophobia app",
    "stopXenofobiaDescription": "Project carried out mainly with React Native. It aims to educate users about xenophobia, providing resources and tools to understand, identify and combat this form of discrimination. The project includes the following functionalities: A section dedicated to explaining what xenophobia is, its causes, consequences and how it manifests itself in society. This section provides a solid knowledge base for all users. A list of places and organizations that users can access if they are experiencing xenophobia. This includes help centres, helplines and non-profit organizations specializing in anti-discrimination. An interactive dictionary that defines terms and words related to different cases of discrimination, not only xenophobia, but also racism, homophobia, sexism, among others. This resource helps users better understand the language and concepts associated with different forms of discrimination. A game designed to help users learn and reinforce dictionary words and concepts. The game uses interactive and playful methods to teach, making learning more engaging and effective. Through questions, users can consolidate their knowledge in a fun way. The main objective of this platform is to raise awareness and educate people about xenophobia and other forms of discrimination, providing them with the necessary tools to recognize and combat these problems in their environment.",
    "ujiPrideTitle": "LTGBIQ+ app",
    "ujiPrideDescription": "Project carried out mainly with React Native. It is designed to educate users about LGTBIQ+ rights and provide them with valuable resources to combat discrimination and promote inclusion. The project includes the following functionalities: A section that offers a comprehensive understanding of LGTBIQ+ rights, including its history, current legislation, and the struggles and advances of the LGTBIQ+ community. This section is essential to educate users about the importance of equality and human rights. A list of places and organizations where users can go if they experience discrimination based on their sexual orientation or gender identity. This includes support centers, helplines, and non-profit organizations dedicated to defending LGTBIQ+ rights. An interactive glossary that defines terms and keywords related to the LGTBIQ+ community and the different aspects of discrimination they may face. This resource is essential to help users understand and correctly use inclusive language and associated concepts. An interactive word-pass game designed to help users learn and reinforce glossary concepts and terms. Through this game, users can test their knowledge in a fun and educational way, improving their understanding and retention of information. The main objective of this platform is to raise awareness and educate people about LGTBIQ+ rights, providing the necessary tools to recognize and combat discrimination, and promoting a more inclusive and respectful environment.",
    "rogerRestaurantTitle": "Management and Reservations Platform for Restaurants",
    "rogerRestaurantDescription": "Project carried out mainly with Next.Js, Next UI, Prisma, Nodemailer. It aims to provide restaurant managers with a tool to manage their profile and users with a platform to make reservations easily and efficiently. The project includes the following functionalities: Administrators can create and manage their restaurant profile. This includes: restaurant name, address, hours, and general description. For their part, users will be able to search for restaurants and make the corresponding reservation. Once the reservation is made, users will receive a confirmation via email with the details of their reservation. Users have the option to cancel or edit their reservations through the platform, with updates sent via email to reflect any changes. The main objective of this platform is to facilitate the management of restaurant profiles for administrators and provide users with a simple and efficient way to make reservations, ensuring a better experience for both restaurant owners and customers.",
    "rekTitle": "Platform for the Energy Rehabilitation of Properties",
    "rekDescription": "Project carried out mainly with Next.Js, Next UI, Prisma, Express, Zod and Stripe. Its objective is to facilitate the energy rehabilitation of properties through a platform that manages three user roles with different responsibilities and functionalities. The platform has the following characteristics: The role of the Promoter, who is the owner of the property, can enter and specify all the necessary information about the property that requires energy rehabilitation, such as location and m². Once the form is completed, the project will be created. The promoter will have access to all the details of the project to see its progress. In turn, you can pay the Admin through each phase progress of the project. It will also have shared document sections, where you will find specific information, and a messages section where you can chat with the admin for any questions or concerns. The role of the agent is to carry out the rehabilitation projects. They can participate in tenders created by the administrator for the property in question. To do this, agents can submit their offers for each tender, detailing how they plan to carry out the project and the associated costs. The selection of the agent in charge of carrying out the rehabilitation is decided by the administrator, who evaluates the proposals and chooses the most appropriate one. And finally, the role of the admin, who is in charge of managing the entire rehabilitation project, ensuring that all aspects of the process are met. Facilitates communication between the developer and agents, ensuring that all parties are aligned and well informed. The admin is responsible for creating the tenders for each rehabilitation project, establishing the terms and conditions of each one. In addition, it manages the payment process to agents once the jobs have been completed according to the agreed terms. The main objective of this platform is to optimize the energy rehabilitation process of properties, providing a comprehensive solution that allows developers to manage their projects, agents to participate in bidding opportunities, and the administrator to supervise and coordinate all related activities."
  },
  "Contact": {
    "title1": "Would you like ",
    "title2": "talking",
    "description": "Get in touch with a simple call or by sending an email. Let me know your proposal and I will contact you as quickly as possible!",
    "name": "Name",
    "placeholderName": "Write your name",
    "email": "Email",
    "placeholderEmail": "Write your name email",
    "phone": "Phone",
    "placeholderPhone": "Write your phone",
    "message": "Message",
    "placeholderMessage": "Let me know your proposals",
    "sendEmail": "Send email",
    "sendMessage": "Send message",
    "visitProfile": "Visit profile"
  }
}
