{
  "common": {
    "close": "Cerrar",
    "download": "Descarga",
    "website": "Sitio web",
    "desaway": "Propiedad de Desaway"
  },
  "Header": {
    "home": "Inicio",
    "projects": "Proyectos",
    "experience": "Experiencia",
    "contact": "Contacto"
  },
  "Home": {
    "welcome": "Hola ! Soy",
    "presentation": "Me considero una persona con mucha curiosidad, lo que me permite estar aprendiendo constantemente nuevas herramientas e implementaciones. Disfruto del trabajo en equipo y de la colaboraci贸n entre todos para alcanzar los objetivos. Estoy abierto a nuevas ideas y formas de trabajar para mejorar como profesional.",
    "nameFunction": "bienvenida",
    "aboutMe": "sobreMi",
    "name": "nombre",
    "lastName": "apellido",
    "age": "edad",
    "languages": "idiomas",
    "spanish": "espa帽ol",
    "english": "ingl茅s",
    "currentCountry": "paisActual",
    "spain": "Espa帽a",
    "nationality": "nacionalidad",
    "argentina": "Argentina",
    "italian": "Italiana",
    "viewCV": "Ver CV"
  },
  "Skills": {
    "title": "Tecnolog铆as",
    "js": "JavaScript (JS) es un lenguaje de programaci贸n ligero, interpretado, o compilado justo-a-tiempo (just-in-time) con funciones de primera clase. Es un lenguaje basado en prototipos, multiparadigma, de un solo hilo, din谩mico, con soporte para programaci贸n orientada a objetos, imperativa y declarativa (por ejemplo programaci贸n funcional).",
    "next": "Next.js es un marco de React para crear aplicaciones web de pila completa. Utiliza React Components para crear interfaces de usuario y Next.js para funciones y optimizaciones adicionales. Debajo del cap贸, Next.js tambi茅n abstrae y configura autom谩ticamente las herramientas necesarias para React, como agrupaci贸n, compilaci贸n y m谩s. Esto le permite concentrarse en crear su aplicaci贸n en lugar de dedicar tiempo a la configuraci贸n.",
    "react": "React es una biblioteca de JavaScript para representar interfaces de usuario. La interfaz de usuario se construye a partir de unidades peque帽as como botones, texto e im谩genes. React te permite combinarlos en componentes encajables y reutilizables. React Native es un marco de c贸digo abierto para crear aplicaciones de Android e iOS utilizando React y las capacidades nativas de la plataforma de aplicaciones.",
    "firebase": "Firebase es una plataforma en la nube para el desarrollo de aplicaciones web y m贸vil. Su funci贸n esencial es hacer m谩s sencilla la creaci贸n de aplicaciones webs como m贸viles y su desarrollo. Sus herramientas son variadas y de f谩cil uso. Las finalidades de las mismas se pueden dividir en cuatro grupos: desarrollo, crecimiento, monetizaci贸n y an谩lisis.",
    "ts": "TypeScript es un superconjunto de JavaScript que a帽ade tipado est谩tico opcional y funciones avanzadas a JavaScript. Ha sido desarrollado por Microsoft y se public贸 por primera vez en octubre de 2012. Permite que podamos escribir c贸digo con menos errores, de manera m谩s sencilla, coherente y f谩cil de probar.",
    "node": "Node.js es un entorno de ejecuci贸n de JavaScript multiplataforma y de c贸digo abierto. Una aplicaci贸n Node.js se ejecuta en un solo proceso, sin crear un nuevo hilo para cada solicitud. Cuando Node.js realiza una operaci贸n de E/S, como acceder a una base de datos, en lugar de bloquear el subproceso y desperdiciar ciclos de CPU esperando, Node.js reanudar谩 las operaciones cuando llegue la respuesta.Esto permite a Node.js manejar miles de conexiones simult谩neas con un 煤nico servidor.",
    "prisma": "Prisma es un ORM de c贸digo abierto de pr贸xima generaci贸n. Consta de las siguientes partes: Prisma Client: generador de consultas generado autom谩ticamente y con seguridad de tipos para Node.js y TypeScript. Prisma Migrate: sistema de migraci贸n. Prisma Studio: GUI para ver y editar datos en su base de datos. Prisma Client se puede utilizar en cualquier aplicaci贸n backend de Node.js o TypeScript. Puede ser una API REST, una API GraphQL, una API gRPC o cualquier otra cosa que necesite una base de datos.",
    "postgres": "PostgreSQL es un potente sistema de base de datos relacional de objetos de c贸digo abierto que utiliza y ampl铆a el lenguaje SQL combinado con muchas funciones que almacenan y escalan de forma segura las cargas de trabajo de datos m谩s complicadas. PostgreSQL viene con muchas funciones destinadas a ayudar a los desarrolladores a crear aplicaciones, a proteger la integridad de los datos, a crear entornos tolerantes a fallas, y ayudarlos a administrar sus datos sin importar cu谩n grande o peque帽o sea el conjunto de datos."
  },
  "Projects": {
    "title": "Proyectos",
    "subtitle": "Los proyectos mostrados a continuaci贸n fueron desarrollados en colaboraci贸n con la empresa Desaway y est谩n sujetos a derechos de privacidad y confidencialidad. Por esta raz贸n, no puedo proporcionar informaci贸n detallada ni im谩genes adicionales. Agradezco su comprensi贸n.",
    "bitePlanner": "Planificador y organizador de comidas desarrollado con React Native y MobX. Crea planes de comida personalizados para cada d铆a de la semana, asegurando una alimentaci贸n balanceada y variada.",
    "pokedex": "Descubre y analiza los primeros 150 pokem贸n. Aplicaci贸n desarrollada con React Native donde utilizo una API de terceros para obtener la informaci贸n.",
    "moviesDB": "Investiga los 煤ltimos estrenos, las pel铆culas m谩s populares y descubre su sinopsis. Aplicaci贸n desarrollada con React Native donde utilizo una API de terceros para obtener la informaci贸n.",
    "calculator": "Proyecto llevado a cabo con React Native donde busco imitar la calculadora de iOS. Posee las principales funciones de suma, resta, divisi贸n, multiplicaci贸n.",
    "workhub": "Plataforma dise帽ada para la gesti贸n y reserva de espacios de trabajo, salas de reuniones y espacios compartidos. Puedes crear f谩cilmente 谩reas de trabajo personalizadas y optimizadas para tus necesidades espec铆ficas.",
    "labelPlatformTitle": "Plataforma de etiquetas",
    "labelPlatformDescription": "Proyecto creado principalmente con Next.Js, Next UI y Prisma. Tiene como objetivo optimizar la gesti贸n de env铆os mediante la agrupaci贸n de pedidos iguales. La plataforma permite a los usuarios completar un pedido individual o agrupar m煤ltiples pedidos id茅nticos en un solo conjunto. El proceso funciona de la siguiente manera: Los usuarios ingresan sus pedidos en la plataforma. La interfaz detecta autom谩ticamente los pedidos que contienen los mismos productos. Los pedidos iguales se agrupan, permitiendo a los usuarios gestionarlos de manera conjunta. Esto no solo simplifica el proceso de env铆o, sino que tambi茅n puede reducir costos y tiempo de procesamiento. Los usuarios pueden optar por completar un pedido individualmente o el conjunto de pedidos agrupados. Una vez que el usuario decide completar el pedido (individual o conjunto), el sistema genera autom谩ticamente una etiqueta de env铆o. Esta etiqueta incluye toda la informaci贸n necesaria para el despacho del paquete por correo. El principal beneficio de este sistema es la eficiencia mejorada en la gesti贸n de pedidos y env铆os, permitiendo un proceso m谩s r谩pido y econ贸mico. La agrupaci贸n de pedidos tambi茅n reduce el n煤mero de env铆os necesarios, contribuyendo a pr谩cticas m谩s sostenibles.",
    "stopXenofobiaTitle": "Aplicaci贸n sobre Xenofobia",
    "stopXenofobiaDescription": "Proyecto realizado principalmente con React Native. Tiene como objetivo educar a los usuarios sobre la xenofobia, proporcionando recursos y herramientas para comprender, identificar y combatir esta forma de discriminaci贸n. El proyecto incluye las siguientes funcionalidades: Una secci贸n dedicada a explicar qu茅 es la xenofobia, sus causas, consecuencias y c贸mo se manifiesta en la sociedad. Esta secci贸n proporciona una base s贸lida de conocimientos para todos los usuarios. Una lista de lugares y organizaciones a las que los usuarios pueden acceder si est谩n sufriendo xenofobia. Esto incluye centros de ayuda, l铆neas telef贸nicas de asistencia y organizaciones sin fines de lucro especializadas en la lucha contra la discriminaci贸n. Un diccionario interactivo que define t茅rminos y palabras relacionadas con distintos casos de discriminaci贸n, no solo xenofobia, sino tambi茅n racismo, homofobia, sexismo, entre otros. Este recurso ayuda a los usuarios a entender mejor el lenguaje y los conceptos asociados con diferentes formas de discriminaci贸n. Un juego dise帽ado para ayudar a los usuarios a aprender y reforzar las palabras y conceptos del diccionario. El juego utiliza m茅todos interactivos y l煤dicos para ense帽ar, haciendo que el aprendizaje sea m谩s atractivo y efectivo. A trav茅s de preguntas, los usuarios pueden consolidar sus conocimientos de manera divertida. El objetivo principal de esta plataforma es crear conciencia y educar a las personas sobre la xenofobia y otras formas de discriminaci贸n, brind谩ndoles las herramientas necesarias para reconocer y combatir estos problemas en su entorno.",
    "ujiPrideTitle": "Aplicaci贸n sobre LTGBIQ+",
    "ujiPrideDescription": "Proyecto realizado principalmente con React Native. Est谩 dise帽ado para educar a los usuarios sobre los derechos LGTBIQ+ y proporcionarles recursos valiosos para combatir la discriminaci贸n y promover la inclusi贸n. El proyecto incluye las siguientes funcionalidades: Una secci贸n que ofrece una comprensi贸n exhaustiva de los derechos LGTBIQ+, incluyendo su historia, legislaci贸n actual, y las luchas y avances de la comunidad LGTBIQ+. Esta secci贸n es fundamental para educar a los usuarios sobre la importancia de la igualdad y los derechos humanos. Una lista de lugares y organizaciones a las que los usuarios pueden acudir si sufren discriminaci贸n por su orientaci贸n sexual o identidad de g茅nero. Esto incluye centros de apoyo, l铆neas de asistencia, y organizaciones sin fines de lucro dedicadas a la defensa de los derechos LGTBIQ+. Un glosario interactivo que define t茅rminos y palabras clave relacionadas con la comunidad LGTBIQ+ y los distintos aspectos de la discriminaci贸n que pueden enfrentar. Este recurso es esencial para ayudar a los usuarios a entender y utilizar correctamente el lenguaje inclusivo y los conceptos asociados. Un juego interactivo de pasapalabra dise帽ado para ayudar a los usuarios a aprender y reafirmar los conceptos y t茅rminos del glosario. A trav茅s de este juego, los usuarios pueden poner a prueba sus conocimientos de una manera divertida y educativa, mejorando su comprensi贸n y retenci贸n de la informaci贸n. El objetivo principal de esta plataforma es crear conciencia y educar a las personas sobre los derechos LGTBIQ+, proporcionando las herramientas necesarias para reconocer y combatir la discriminaci贸n, y promoviendo un entorno m谩s inclusivo y respetuoso.",
    "rogerRestaurantTitle": "Plataforma de Gesti贸n y Reservas para Restaurantes",
    "rogerRestaurantDescription": "Proyecto realizado principalmente con Next.Js, Next UI, Prisma, Nodemailer. Tiene como objetivo proporcionar a los administradores de restaurantes una herramienta para gestionar su perfil y a los usuarios una plataforma para realizar reservas de manera f谩cil y eficiente. El proyecto incluye las siguientes funcionalidades: Los administradores pueden crear y gestionar el perfil de su restaurante. Esto incluye: nombre del restaurante, direcci贸n, horarios y descripci贸n general. Por su parte los usuarios podr谩n buscar restaurantes y realizar la reserva correspondiente. Una vez realizada la reserva, los usuarios recibir谩n una confirmaci贸n v铆a correo electr贸nico con los detalles de su reserva. Los usuarios tienen la opci贸n de cancelar o editar sus reservas a trav茅s de la plataforma, con actualizaciones enviadas por correo electr贸nico para reflejar cualquier cambio. El objetivo principal de esta plataforma es facilitar la gesti贸n de perfiles de restaurantes para los administradores y proporcionar a los usuarios una manera sencilla y eficiente de hacer reservas, asegurando una mejor experiencia tanto para los propietarios de los restaurantes como para los clientes.",
    "rekTitle": "Plataforma para la Rehabilitaci贸n Energ茅tica de Inmuebles",
    "rekDescription": "Proyecto realizado principalmente con Next.Js, Next UI, Prisma, Express, Zod y Stripe. Tiene como objetivo facilitar la rehabilitaci贸n energ茅tica de inmuebles mediante una plataforma que gestiona tres roles de usuarios con diferentes responsabilidades y funcionalidades. La plataforma cuenta con las siguientes caracter铆sticas: El rol del Promotor, el cual, es el due帽o del inmueble, puede ingresar y especificar toda la informaci贸n necesaria sobre el inmueble que requiere rehabilitaci贸n energ茅tica, como la ubicaci贸n y los m虏. Una vez completado el formulario, se crear谩 el proyecto. El promotor tendr谩 acceso a todo el detalle del proyecto para ver su progreso. A su vez podr谩 pagarle al Admin mediante cada avance de fase del proyecto. Tambi茅n tendr谩 secciones de documentos compartidos, donde encontrar谩 informaci贸n espec铆fica, y una secci贸n de mensajes donde podr谩 chatear con el admin por cual duda o inconveniente. El rol del agente es llevar a cabo los proyectos de rehabilitaci贸n. Pueden participar en licitaciones creadas por el administrador para el inmueble en cuesti贸n. Para ello, los agentes pueden presentar sus ofertas para cada licitaci贸n, detallando c贸mo planean llevar a cabo el proyecto y los costos asociados. La selecci贸n del agente encargado de realizar la rehabilitaci贸n es decidida por el administrador, quien eval煤a las propuestas y elige la m谩s adecuada. Y por 煤ltimo, el rol del admin, el cual, es el encargado de manejar todo el proyecto de rehabilitaci贸n, asegurando que se cumplan todos los aspectos del proceso. Facilita la comunicaci贸n entre el promotor y los agentes, asegurando que todas las partes est茅n alineadas y bien informadas. El admin es responsable de crear las licitaciones para cada proyecto de rehabilitaci贸n, estableciendo los t茅rminos y condiciones de cada una. Adem谩s, gestiona el proceso de pago a los agentes una vez que los trabajos se han completado conforme a los t茅rminos acordados. El objetivo principal de esta plataforma es optimizar el proceso de rehabilitaci贸n energ茅tica de inmuebles, proporcionando una soluci贸n integral que permita a los promotores gestionar sus proyectos, a los agentes participar en oportunidades de licitaci贸n y al administrador supervisar y coordinar todas las actividades relacionadas."
  },
  "Contact": {
    "title1": "驴 Nos ponemos en ",
    "title2": "contacto",
    "description": "Comun铆cate a trav茅s de una simple llamada o enviando un correo. Hazme saber tu propuesta y me comunicar茅 lo m谩s r谩pido posible!",
    "name": "Nombre",
    "placeholderName": "Escribe tu nombre",
    "email": "Correo electr贸nico",
    "placeholderEmail": "Escribe tu correo",
    "phone": "Tel茅fono",
    "placeholderPhone": "Escribe tu tel茅fono",
    "message": "Mensaje",
    "placeholderMessage": "Hazme saber tus propuestas",
    "sendEmail": "Enviar correo",
    "sendMessage": "Enviar mensaje",
    "visitProfile": "Visitar perfil"
  }
}
