{
  "common": {
    "close": "Cerrar",
    "download": "Descarga",
    "website": "Sitio web",
    "desaway": "Propiedad de Desaway"
  },
  "Header": {
    "home": "Inicio",
    "projects": "Proyectos",
    "experience": "Experiencia",
    "contact": "Contacto"
  },
  "Home": {
    "welcome": "Hola ! Soy",
    "presentation": "Me considero una persona con mucha curiosidad, lo que me permite estar aprendiendo constantemente nuevas herramientas e implementaciones. Disfruto del trabajo en equipo y de la colaboraci贸n entre todos para alcanzar los objetivos. Estoy abierto a nuevas ideas y formas de trabajar para mejorar como profesional.",
    "nameFunction": "bienvenida",
    "aboutMe": "sobreMi",
    "name": "nombre",
    "lastName": "apellido",
    "age": "edad",
    "languages": "idiomas",
    "spanish": "espa帽ol",
    "english": "ingl茅s",
    "currentCountry": "paisActual",
    "spain": "Espa帽a",
    "nationality": "nacionalidad",
    "argentina": "Argentina",
    "italian": "Italiana",
    "viewCV": "Ver CV"
  },
  "Skills": {
    "title": "Tecnolog铆as",
    "js": "JavaScript (JS) es un lenguaje de programaci贸n ligero, interpretado, o compilado justo-a-tiempo (just-in-time) con funciones de primera clase. Es un lenguaje basado en prototipos, multiparadigma, de un solo hilo, din谩mico, con soporte para programaci贸n orientada a objetos, imperativa y declarativa (por ejemplo programaci贸n funcional).",
    "next": "Next.js es un marco de React para crear aplicaciones web de pila completa. Utiliza React Components para crear interfaces de usuario y Next.js para funciones y optimizaciones adicionales. Debajo del cap贸, Next.js tambi茅n abstrae y configura autom谩ticamente las herramientas necesarias para React, como agrupaci贸n, compilaci贸n y m谩s. Esto le permite concentrarse en crear su aplicaci贸n en lugar de dedicar tiempo a la configuraci贸n.",
    "react": "React es una biblioteca de JavaScript para representar interfaces de usuario. La interfaz de usuario se construye a partir de unidades peque帽as como botones, texto e im谩genes. React te permite combinarlos en componentes encajables y reutilizables. React Native es un marco de c贸digo abierto para crear aplicaciones de Android e iOS utilizando React y las capacidades nativas de la plataforma de aplicaciones.",
    "firebase": "Firebase es una plataforma en la nube para el desarrollo de aplicaciones web y m贸vil. Su funci贸n esencial es hacer m谩s sencilla la creaci贸n de aplicaciones webs como m贸viles y su desarrollo. Sus herramientas son variadas y de f谩cil uso. Las finalidades de las mismas se pueden dividir en cuatro grupos: desarrollo, crecimiento, monetizaci贸n y an谩lisis.",
    "ts": "TypeScript es un superconjunto de JavaScript que a帽ade tipado est谩tico opcional y funciones avanzadas a JavaScript. Ha sido desarrollado por Microsoft y se public贸 por primera vez en octubre de 2012. Permite que podamos escribir c贸digo con menos errores, de manera m谩s sencilla, coherente y f谩cil de probar.",
    "node": "Node.js es un entorno de ejecuci贸n de JavaScript multiplataforma y de c贸digo abierto. Una aplicaci贸n Node.js se ejecuta en un solo proceso, sin crear un nuevo hilo para cada solicitud. Cuando Node.js realiza una operaci贸n de E/S, como acceder a una base de datos, en lugar de bloquear el subproceso y desperdiciar ciclos de CPU esperando, Node.js reanudar谩 las operaciones cuando llegue la respuesta.Esto permite a Node.js manejar miles de conexiones simult谩neas con un 煤nico servidor.",
    "prisma": "Prisma es un ORM de c贸digo abierto de pr贸xima generaci贸n. Consta de las siguientes partes: Prisma Client: generador de consultas generado autom谩ticamente y con seguridad de tipos para Node.js y TypeScript. Prisma Migrate: sistema de migraci贸n. Prisma Studio: GUI para ver y editar datos en su base de datos. Prisma Client se puede utilizar en cualquier aplicaci贸n backend de Node.js o TypeScript. Puede ser una API REST, una API GraphQL, una API gRPC o cualquier otra cosa que necesite una base de datos.",
    "postgres": "PostgreSQL es un potente sistema de base de datos relacional de objetos de c贸digo abierto que utiliza y ampl铆a el lenguaje SQL combinado con muchas funciones que almacenan y escalan de forma segura las cargas de trabajo de datos m谩s complicadas. PostgreSQL viene con muchas funciones destinadas a ayudar a los desarrolladores a crear aplicaciones, a proteger la integridad de los datos, a crear entornos tolerantes a fallas, y ayudarlos a administrar sus datos sin importar cu谩n grande o peque帽o sea el conjunto de datos."
  },
  "Projects": {
    "title": "Proyectos",
    "bitePlanner": "Planificador y organizador de comidas desarrollado con React Native y MobX. Crea planes de comida personalizados para cada d铆a de la semana, asegurando una alimentaci贸n balanceada y variada.",
    "stopXenofobia": "Aplicaci贸n desarrollada con React Native destinada a informar sobre los recursos disponibles para la garant铆a de los derechos humanos ante el racismo y la xenofobia.",
    "pokedex": "Descubre y analiza los primeros 150 pokem贸n. Aplicaci贸n desarrollada con React Native donde utilizo una API de terceros para obtener la informaci贸n.",
    "moviesDB": "Investiga los 煤ltimos estrenos, las pel铆culas m谩s populares y descubre su sinopsis. Aplicaci贸n desarrollada con React Native donde utilizo una API de terceros para obtener la informaci贸n.",
    "calculator": "Proyecto llevado a cabo con React Native donde busco imitar la calculadora de iOS. Posee las principales funciones de suma, resta, divisi贸n, multiplicaci贸n.",
    "rogerRestaurant": "Sitio web de reservas en restaurantes desarrollado con Next.Js. El due帽o del restaurante podr谩 obtener todos los datos de las mismas para realizar un seguimiento minucioso."
  },
  "Contact": {
    "title1": "Nos ponemos en ",
    "title2": "contacto",
    "description": "Comun铆cate a trav茅s de una simple llamada o completando el formulario. Hazme saber tu propuesta y me comunicar茅 lo m谩s r谩pido posible!",
    "name": "Nombre",
    "placeholderName": "Escribe tu nombre",
    "email": "Correo electr贸nico",
    "placeholderEmail": "Escribe tu correo",
    "phone": "Tel茅fono",
    "placeholderPhone": "Escribe tu tel茅fono",
    "message": "Mensaje",
    "placeholderMessage": "Hazme saber tus propuestas"
  }
}
