{
  "common": {
    "close": "Cerrar",
    "download": "Descarga",
    "website": "Sitio web",
    "desaway": "Propiedad de Desaway"
  },
  "Header": {
    "home": "Inicio",
    "projects": "Proyectos",
    "experience": "Experiencia",
    "contact": "Contacto"
  },
  "Home": {
    "welcome": "Hola 游둤游낕! Soy",
    "presentation": "Me considero una persona con mucha curiosidad, lo que me permite estar aprendiendo constantemente nuevas herramientas e implementaciones. Disfruto del trabajo en equipo y de la colaboraci칩n entre todos para alcanzar los objetivos. Estoy abierto a nuevas ideas y formas de trabajar para mejorar como profesional.",
    "nameFunction": "bienvenida",
    "aboutMe": "sobreMi",
    "name": "nombre",
    "lastName": "apellido",
    "age": "edad",
    "languages": "idiomas",
    "spanish": "espa침ol",
    "english": "ingl칠s",
    "currentCountry": "paisActual",
    "spain": "Espa침a",
    "nationality": "nacionalidad",
    "argentina": "Argentina",
    "italian": "Italiana",
    "viewCV": "Ver CV"
  },
  "Skills": {
    "title": "Tecnolog칤as",
    "js": "JavaScript (JS) es un lenguaje de programaci칩n ligero, interpretado, o compilado justo-a-tiempo (just-in-time) con funciones de primera clase. Es un lenguaje basado en prototipos, multiparadigma, de un solo hilo, din치mico, con soporte para programaci칩n orientada a objetos, imperativa y declarativa (por ejemplo programaci칩n funcional).",
    "next": "Next.js es un marco de React para crear aplicaciones web de pila completa. Utiliza React Components para crear interfaces de usuario y Next.js para funciones y optimizaciones adicionales. Debajo del cap칩, Next.js tambi칠n abstrae y configura autom치ticamente las herramientas necesarias para React, como agrupaci칩n, compilaci칩n y m치s. Esto le permite concentrarse en crear su aplicaci칩n en lugar de dedicar tiempo a la configuraci칩n.",
    "react": "React es una biblioteca de JavaScript para representar interfaces de usuario. La interfaz de usuario se construye a partir de unidades peque침as como botones, texto e im치genes. React te permite combinarlos en componentes encajables y reutilizables. React Native es un marco de c칩digo abierto para crear aplicaciones de Android e iOS utilizando React y las capacidades nativas de la plataforma de aplicaciones.",
    "firebase": "Firebase es una plataforma en la nube para el desarrollo de aplicaciones web y m칩vil. Su funci칩n esencial es hacer m치s sencilla la creaci칩n de aplicaciones webs como m칩viles y su desarrollo. Sus herramientas son variadas y de f치cil uso. Las finalidades de las mismas se pueden dividir en cuatro grupos: desarrollo, crecimiento, monetizaci칩n y an치lisis.",
    "ts": "TypeScript es un superconjunto de JavaScript que a침ade tipado est치tico opcional y funciones avanzadas a JavaScript. Ha sido desarrollado por Microsoft y se public칩 por primera vez en octubre de 2012. Permite que podamos escribir c칩digo con menos errores, de manera m치s sencilla, coherente y f치cil de probar.",
    "node": "Node.js es un entorno de ejecuci칩n de JavaScript multiplataforma y de c칩digo abierto. Una aplicaci칩n Node.js se ejecuta en un solo proceso, sin crear un nuevo hilo para cada solicitud. Cuando Node.js realiza una operaci칩n de E/S, como acceder a una base de datos, en lugar de bloquear el subproceso y desperdiciar ciclos de CPU esperando, Node.js reanudar치 las operaciones cuando llegue la respuesta.Esto permite a Node.js manejar miles de conexiones simult치neas con un 칰nico servidor.",
    "prisma": "Prisma es un ORM de c칩digo abierto de pr칩xima generaci칩n. Consta de las siguientes partes: Prisma Client: generador de consultas generado autom치ticamente y con seguridad de tipos para Node.js y TypeScript. Prisma Migrate: sistema de migraci칩n. Prisma Studio: GUI para ver y editar datos en su base de datos. Prisma Client se puede utilizar en cualquier aplicaci칩n backend de Node.js o TypeScript. Puede ser una API REST, una API GraphQL, una API gRPC o cualquier otra cosa que necesite una base de datos.",
    "postgres": "PostgreSQL es un potente sistema de base de datos relacional de objetos de c칩digo abierto que utiliza y ampl칤a el lenguaje SQL combinado con muchas funciones que almacenan y escalan de forma segura las cargas de trabajo de datos m치s complicadas. PostgreSQL viene con muchas funciones destinadas a ayudar a los desarrolladores a crear aplicaciones, a proteger la integridad de los datos, a crear entornos tolerantes a fallas, y ayudarlos a administrar sus datos sin importar cu치n grande o peque침o sea el conjunto de datos."
  },
  "Projects": {
    "title": "Proyectos",
    "subtitle": "Los proyectos mostrados a continuaci칩n fueron desarrollados en colaboraci칩n con la empresa Desaway y est치n sujetos a derechos de privacidad y confidencialidad. Por esta raz칩n, no puedo proporcionar informaci칩n detallada ni im치genes adicionales. Agradezco su comprensi칩n.",
    "bitePlanner": "Planificador y organizador de comidas desarrollado con React Native y MobX. Crea planes de comida personalizados para cada d칤a de la semana, asegurando una alimentaci칩n balanceada y variada.",
    "pokedex": "Descubre y analiza los primeros 150 pokem칩n. Aplicaci칩n desarrollada con React Native donde utilizo una API de terceros para obtener la informaci칩n.",
    "moviesDB": "Investiga los 칰ltimos estrenos, las pel칤culas m치s populares y descubre su sinopsis. Aplicaci칩n desarrollada con React Native donde utilizo una API de terceros para obtener la informaci칩n.",
    "calculator": "Proyecto llevado a cabo con React Native donde busco imitar la calculadora de iOS. Posee las principales funciones de suma, resta, divisi칩n, multiplicaci칩n.",
    "rogerRestaurant": "Sitio web de reservas en restaurantes desarrollado con Next.Js. El due침o del restaurante podr치 obtener todos los datos de las mismas para realizar un seguimiento minucioso.",
    "workhub": "Plataforma dise침ada para la gesti칩n y reserva de espacios de trabajo, salas de reuniones y espacios compartidos. Puedes crear f치cilmente 치reas de trabajo personalizadas y optimizadas para tus necesidades espec칤ficas.",
    "labelPlatformTitle": "Plataforma de etiquetas",
    "labelPlatformDescription": "Proyecto creado principalmente con Next.Js, Next UI y Prisma. Tiene como objetivo optimizar la gesti칩n de env칤os mediante la agrupaci칩n de pedidos iguales. La plataforma permite a los usuarios completar un pedido individual o agrupar m칰ltiples pedidos id칠nticos en un solo conjunto. El proceso funciona de la siguiente manera: Los usuarios ingresan sus pedidos en la plataforma. La interfaz detecta autom치ticamente los pedidos que contienen los mismos productos. Los pedidos iguales se agrupan, permitiendo a los usuarios gestionarlos de manera conjunta. Esto no solo simplifica el proceso de env칤o, sino que tambi칠n puede reducir costos y tiempo de procesamiento. Los usuarios pueden optar por completar un pedido individualmente o el conjunto de pedidos agrupados. Una vez que el usuario decide completar el pedido (individual o conjunto), el sistema genera autom치ticamente una etiqueta de env칤o. Esta etiqueta incluye toda la informaci칩n necesaria para el despacho del paquete por correo. El principal beneficio de este sistema es la eficiencia mejorada en la gesti칩n de pedidos y env칤os, permitiendo un proceso m치s r치pido y econ칩mico. La agrupaci칩n de pedidos tambi칠n reduce el n칰mero de env칤os necesarios, contribuyendo a pr치cticas m치s sostenibles.",
    "stopXenofobiaTitle": "Stop Xenofobia",
    "stopXenofobiaDescription": "Proyecto realizado principalmente con React Native. Tiene como objetivo educar a los usuarios sobre la xenofobia, proporcionando recursos y herramientas para comprender, identificar y combatir esta forma de discriminaci칩n. El proyecto incluye las siguientes funcionalidades: Una secci칩n dedicada a explicar qu칠 es la xenofobia, sus causas, consecuencias y c칩mo se manifiesta en la sociedad. Esta secci칩n proporciona una base s칩lida de conocimientos para todos los usuarios. Una lista de lugares y organizaciones a las que los usuarios pueden acceder si est치n sufriendo xenofobia. Esto incluye centros de ayuda, l칤neas telef칩nicas de asistencia y organizaciones sin fines de lucro especializadas en la lucha contra la discriminaci칩n. Un diccionario interactivo que define t칠rminos y palabras relacionadas con distintos casos de discriminaci칩n, no solo xenofobia, sino tambi칠n racismo, homofobia, sexismo, entre otros. Este recurso ayuda a los usuarios a entender mejor el lenguaje y los conceptos asociados con diferentes formas de discriminaci칩n. Un juego dise침ado para ayudar a los usuarios a aprender y reforzar las palabras y conceptos del diccionario. El juego utiliza m칠todos interactivos y l칰dicos para ense침ar, haciendo que el aprendizaje sea m치s atractivo y efectivo. A trav칠s de preguntas, los usuarios pueden consolidar sus conocimientos de manera divertida. El objetivo principal de esta plataforma es crear conciencia y educar a las personas sobre la xenofobia y otras formas de discriminaci칩n, brind치ndoles las herramientas necesarias para reconocer y combatir estos problemas en su entorno."
  },
  "Contact": {
    "title1": " Nos ponemos en ",
    "title2": "contacto",
    "description": "Comun칤cate a trav칠s de una simple llamada o enviando un correo. Hazme saber tu propuesta y me comunicar칠 lo m치s r치pido posible!",
    "name": "Nombre",
    "placeholderName": "Escribe tu nombre",
    "email": "Correo electr칩nico",
    "placeholderEmail": "Escribe tu correo",
    "phone": "Tel칠fono",
    "placeholderPhone": "Escribe tu tel칠fono",
    "message": "Mensaje",
    "placeholderMessage": "Hazme saber tus propuestas",
    "sendEmail": "Enviar correo",
    "sendMessage": "Enviar mensaje",
    "visitProfile": "Visitar perfil"
  }
}
